"""
Todo    算數運算符
"""
a, b = 20, 10

print(a + b) # 相加
print(a - b) # 相減
print(a * b) # 相乘
print(a / b) # 相除 求 商, 有餘數
print(a // b) # 相除 求 商, 無餘數
print(a % b) # 相除 求 餘
print(a ** 2) # a 的 2 次方

"""
Todo    賦值運算符
"""
a = 10 # 賦值, a 現在就是 10
a += 10 # 累加, a = a + 10
a -= 10 # 累減, 很少用
a *= 10
a /= 10
a %= 10
a //= 10
a **= 10

"""
a = a & 10 => 進行 AND 運算

設 (a = 5):
5 = 0101
10 = 1010
AND 運算 => 0000 => 轉換 = 0
"""
a &= 10

"""
a = a | 10 => 進行 OR 運算

設 (a = 5):
5 = 0101
10 = 1010
OR 運算 => 1111 => 轉換 = 15
"""
a |= 10

"""
a = 0101
10 = 1010
XOR 運算(相同為0, 不同為1) => 1111 => 轉換 = 15
"""
a ^= 10

a >> 10 # 總之就是二進位的偏移, 懶得說明
a << 10

"""
Todo    比較運算符
"""
a == b # 是否相等
a != b # 是否不相等
a > b # 以下不用說明吧
a < b
a >= b
a <= b

a is b # 判斷記憶體位置是否相等
a is not b

a in b # 用於比較列表, a 列表是否在 b 列表中
a not in b

"""
Todo    位元運算符
"""
a & b # AND
a | b # OR
a ^ b # XOR
~a # NOT

"""
Todo    運算優先級
(高 ~ 低)

()

**

+x -x ~x

* / // %

+ -

<< >>

&

^

|

== != > >= < <= is is not in not in

and

or 
"""